<a href="https://colab.research.google.com/github/guyfrancis/dat1001/blob/main/More_Pandas_Practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
data = {"Country": ["Brazil", "Indonesia", "Sao Tome and Principe"], "Production":['3.2M', '794.8K', '8']}

In [ ]:
import pandas as pd
import numpy as np
cd = pd.DataFrame(data)
cd

                 Country Production
0                 Brazil       3.2M
1              Indonesia     794.8K
2  Sao Tome and Principe          8

In [ ]:
cd['Units']="-"
cd['Prod (kt)']=0.0

In [ ]:
cd

                 Country Production Units  Prod (kt)
0                 Brazil       3.2M     -        0.0
1              Indonesia     794.8K     -        0.0
2  Sao Tome and Principe          8     -        0.0

In [ ]:
num_rows = cd.shape[0]
for i in range(num_rows):
    if("M" in cd.iloc[i, 1]):
        cd.iloc[i, 2] = 'M'
        cd.iloc[i, 3] = float(cd.iloc[i, 1].replace("M" , ""))
    elif("K" in cd.iloc[i, 1]):
        cd.iloc[i, 2] ="K"
        cd.iloc[i, 3] = float(cd.iloc[i, 1].replace("K", ""))
    else:
        cd.iloc[i, 3] = float(cd.iloc[i, 1])

In [ ]:
cd

                 Country Production Units  Prod (kt)
0                 Brazil       3.2M     M        3.2
1              Indonesia     794.8K     K      794.8
2  Sao Tome and Principe          8     -        8.0

In [ ]:
# Now update numerical value based on units
for i in range(len(cd['Production'])):
    if(cd.iloc[i, 2]=="M"):
        cd.iloc[i, 3] *=1000
    elif(cd.iloc[i, 2]=="-"):
        cd.iloc[i, 3] /= 1000

In [ ]:
cd

                 Country Production Units  Prod (kt)
0                 Brazil       3.2M     M   3200.000
1              Indonesia     794.8K     K    794.800
2  Sao Tome and Principe          8     -      0.008

In [ ]:
cd. describe()

         Prod (kt)
count     3.000000
mean   1331.602667
std    1666.164766
min       0.008000
25%     397.404000
50%     794.800000
75%    1997.400000
max    3200.000000

In [ ]:
# Now we can answer the key questions
print(f"Total global coffee production is {cd['Prod (kt)'].sum():.2f} kt")
print(f"Mean coffee production for coffee-producing countries is {cd['Prod (kt)'].mean():.2f} kt")

Total global coffee production is 3994.81 kt
Mean coffee production for coffee-producing countries is 1331.60 kt

In [ ]:
print(f"Biggest production for one country {cd['Prod (kt)'].max():.2f} kt")

Biggest production for one country 3200.00 kt

In [ ]:
cd

                 Country Production Units  Prod (kt)
0                 Brazil       3.2M     M   3200.000
1              Indonesia     794.8K     K    794.800
2  Sao Tome and Principe          8     -      0.008